{
  "tape_number": "ML2-238 A",
  "fused_lecture": "No",
  "timing_for_fused_lecture": "No",
  "date": "No date mentioned but Gurudev says in the beginning of the lecture ( 02.03) \" This very day, in this very hall, in front of Thakurji, he accepted sanyas from our Gurudev, Nitya lila pravista om visnupad sri srimad Bhakti Prajnana Keshav Goswami Maharaj\".",
  "location": "No exact information was given about this, but judging from the noise in the background i think this lecture was given in India. - also at 46.50 BV Asrama Maharaj says something about the location: \"This year, this is my first time coming to this temple.\"",
  "category": "Lecture",
  "topics": "- Gurudev tells about the day Srila Prabhupad took sanyas and what preceded before he took sanyas from Param Gurudev ( srila Bhakti Prajnana Keshav Goswami Maharaj)\n- Gurudev gives the meaning of \"danda\". It is Narayan svarupa. It means that i'm giving my mind, body, soul and everything to Mukunda/ Krsna. Sanyas is not an ordinary thing, says Gurudev.\n- Gurudev tells in brief how and when he met Srila Prabhupad, about their friendship, about him helping Srila prabhupad when he came to preach in the west. How Gurudev used to send so many karatals, mrdanga and books to Srila Prabhupad to help him in his mission.\n- Gurudev told that when he went to America, he saw the tree in Tompkins square park, where Srila Prabhupad used to sit and do kirtan with his karatals and his eyes closed.\n- Gurudev told how the hippies used to see Srila Prabhupad as a friend in the beginning and gave him bottle of wine. After some days they began to follow him. They left everything: wine, women and wealth and became from hippie to happy.",
  "gurudeva_timings": "",
  "other_speakers": "32.18 Brajanath prabhu is requested to read the puspanjali to Srila Prabhupad, on behalf of Acarya Maharaj (?).\nHe cannot read it himself because his voice is bad.\n46.08 Asram Maharaj is speaking",
  "kirtana": "No",
  "abrupt_lecture": "end",
  "suggested_title": "Srila Prabhupad taking sanyas",
  "lecture_languages": "English",
  "sound_issues": "- 32.00 interruption, - 43.27 small interruption, - small interruption and then BV Asrama Maharaj starts speaking",
  "comments": "- Date: i think this lecture was spoken on the day Srila Prabhupad took sanyas.",
  "name": "Sunanda dasi",
  "email_address": "example@example.com"
}
